tests/Fixtures/Saloon/BankAccounts/fetch-a-list-of-bank-accounts.json

{"statusCode":200,"headers":{"Date":"Wed, 13 Dec 2023 12:52:53 GMT","Content-Type":"application\/json","Content-Length":"587","Connection":"keep-alive","ratelimit-reset":"7","x-ratelimit-remaining-minute":"997","x-ratelimit-limit-minute":"1000","ratelimit-remaining":"997","ratelimit-limit":"1000","x-total-count":"1","x-limit":"500","x-offset":"0","Cache-Control":"no-store","pragma":"no-cache","vary":"Origin","access-control-allow-origin":"https:\/\/office.bexio.com","via":"1.1 google","alt-svc":"h3=\":443\"; ma=86400","CF-Cache-Status":"DYNAMIC","Server":"cloudflare","CF-RAY":"834e58c90a3018cb-FRA"},"data":"[{\"id\":1,\"uuid\":\"8bc53d7d-953d-11ea-8073-42010a7c00c5\",\"name\":\"Example bank\",\"owner\":\"Muster Hans\",\"owner_address\":\"M\\u00fchlematten 12\",\"owner_zip\":\"4455\",\"owner_city\":\"Zunzgen\",\"bc_nr\":\"00769\",\"bank_name\":\"Basellandschaftliche Kantonalbank\",\"bank_account_nr\":\"440037302001\",\"iban_nr\":\"CH4500769440037302001\",\"currency_id\":1,\"account_id\":115,\"remarks\":null,\"is_esr\":false,\"esr_besr_id\":\"\",\"esr_bottom_line_include_amount\":true,\"esr_post_account_nr\":\"\",\"esr_payment_for_text\":\"\",\"esr_in_favour_of_text\":\"\",\"invoice_mode\":\"none\",\"qr_invoice_iban\":null,\"type\":\"bank\",\"bank_nr\":\"BLKBCH22\"}]"}